<a href="https://colab.research.google.com/github/nataliatasso/WMC_notebooks/blob/main/%5BNOTEBOOK_5%5D_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exercícios Banco de Dados

In [ ]:
import sqlite3

In [ ]:
conexao = sqlite3.connect('banco.db')
cursor = conexao.cursor()

1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).

In [ ]:
cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(100));')

2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [ ]:
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (1, "Natalia Tasso", 30, "Biologia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (2, "Rodrigo Luiz", 31, "Letras")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (3, "Nicole Biggi", 30, "Engenharia")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (4, "Catarina Freitas", 31, "Jornalismo")')
cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES (5, "Eli Fidelis", 30, "Design")')

3. Consultas Básicas - escreva consultas SQL para realizar as seguintes tarefas:

In [ ]:
# Consultas SQL

# a) Selecionar todos os registros da tabela "alunos".
df = cursor.execute('SELECT * FROM alunos')
for alunos in df:
    print(alunos)

(1, 'Natalia Tasso', 30, 'Biologia')
(2, 'Rodrigo Luiz', 31, 'Letras')
(3, 'Nicole Biggi', 30, 'Engenharia')
(4, 'Catarina Freitas', 31, 'Jornalismo')
(5, 'Eli Fidelis', 30, 'Design')

In [ ]:
# b) Selecionar o nome e a idade dos alunos com mais de 20 anos.
df = cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
for alunos in df:
    print(alunos)

('Natalia Tasso', 30)
('Rodrigo Luiz', 31)
('Nicole Biggi', 30)
('Catarina Freitas', 31)
('Eli Fidelis', 30)

In [ ]:
# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.
df = cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome ASC')
for alunos in df:
    print(alunos)

(3, 'Nicole Biggi', 30, 'Engenharia')

In [ ]:
# d) Contar o número total de alunos na tabela
df = cursor.execute('SELECT COUNT (*) FROM alunos')
for alunos in df:
    print(alunos)

(5,)

4. Atualização e Remoção

In [ ]:
# a) Atualize a idade de um aluno específico na tabela.
cursor.execute('UPDATE alunos SET idade = 31 WHERE nome = "Natalia Tasso"')
df = cursor.execute('SELECT * FROM alunos')
for alunos in df:
    print(alunos)

(1, 'Natalia Tasso', 31, 'Biologia')
(2, 'Rodrigo Luiz', 31, 'Letras')
(3, 'Nicole Biggi', 30, 'Engenharia')
(4, 'Catarina Freitas', 31, 'Jornalismo')
(5, 'Eli Fidelis', 30, 'Design')

In [ ]:
# b) Remova um aluno pelo seu ID.
cursor.execute('DELETE FROM alunos WHERE id = 5')
df = cursor.execute('SELECT * FROM alunos')
for alunos in df:
    print(alunos)

(1, 'Natalia Tasso', 31, 'Biologia')
(2, 'Rodrigo Luiz', 31, 'Letras')
(3, 'Nicole Biggi', 30, 'Engenharia')
(4, 'Catarina Freitas', 31, 'Jornalismo')

5. Criar uma Tabela e Inserir Dados: crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.

In [ ]:
cursor.execute('CREATE TABLE clientes(id INT PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT);')

In [ ]:
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (1, "Natalia Tasso", 31, 1840)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (2, "Rodrigo Luiz", 31, 1022)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (3, "Nicole Biggi", 30, 998)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (4, "Catarina Freitas", 31, 1540)')
cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES (5, "Eli Fidelis", 30, 1823)')

In [ ]:
df = cursor.execute('SELECT * FROM clientes')
for clientes in df:
    print(clientes)

(1, 'Natalia Tasso', 31, 1840.0)
(2, 'Rodrigo Luiz', 31, 1022.0)
(3, 'Nicole Biggi', 30, 998.0)
(4, 'Catarina Freitas', 31, 1540.0)
(5, 'Eli Fidelis', 30, 1823.0)

6. Consultas e Funções Agregadas - Escreva consultas SQL para realizar as seguintes tarefas:

In [ ]:
# a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.
df = cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
for clientes in df:
    print(clientes)

('Natalia Tasso', 31)
('Rodrigo Luiz', 31)
('Catarina Freitas', 31)

In [ ]:
# b) Calcule o saldo médio dos clientes.
df = cursor.execute('SELECT AVG (saldo) FROM clientes')

for clientes in df:
    saldo_medio = clientes[0]  # O resultado vem como uma tupla, onde o saldo médio está no primeiro elemento

print(f"O saldo médio dos clientes é de {saldo_medio:.2f} reais.")

O saldo médio dos clientes é de 1444.60 reais.

In [ ]:
# c) Encontre o cliente com o saldo máximo.
df = cursor.execute('SELECT nome, saldo FROM clientes ORDER BY saldo DESC LIMIT 1')

for clientes in df:
   nome = clientes[0]
   saldo_max = clientes[1]

print(f"O cliente com saldo máximo é {nome}, com {saldo_max:.2f} reais.")

O cliente com saldo máximo é Natalia Tasso, com 1840.00 reais.

In [ ]:
# d) Conte quantos clientes têm saldo acima de 1000.
df = cursor.execute('SELECT COUNT (*) FROM clientes WHERE saldo > 1000')

for clientes in df:
    saldo_mil = clientes[0]

print(f"Um total de {saldo_mil} clientes possui saldo superior a 1000 reais.")

Um total de 4 clientes possui saldo superior a 1000 reais.

7. Atualização e Remoção com Condições.

In [ ]:
# a) Atualize o saldo de um cliente específico.
cursor.execute('UPDATE clientes SET saldo = 950 WHERE nome = "Nicole Biggi"')
df = cursor.execute('SELECT * FROM clientes')
for clientes in df:
    print(clientes)

(1, 'Natalia Tasso', 31, 1840.0)
(2, 'Rodrigo Luiz', 31, 1022.0)
(3, 'Nicole Biggi', 30, 950.0)
(4, 'Catarina Freitas', 31, 1540.0)
(5, 'Eli Fidelis', 30, 1823.0)

In [ ]:
# b) Remova um cliente pelo seu ID.
cursor.execute('DELETE FROM clientes WHERE id = 5')
df = cursor.execute('SELECT * FROM clientes')
for clientes in df:
    print(clientes)

(1, 'Natalia Tasso', 31, 1840.0)
(2, 'Rodrigo Luiz', 31, 1022.0)
(3, 'Nicole Biggi', 30, 950.0)
(4, 'Catarina Freitas', 31, 1540.0)

8. Junção de Tabelas: crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [ ]:
# Criando a tabela

cursor.execute('CREATE TABLE compras(id INT PRIMARY KEY, cliente_id INT, produto VARCHAR(100), valor FLOAT, FOREIGN KEY (cliente_id) REFERENCES clientes (id));')

In [ ]:
# Inserir dados na tabela

cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES (1, "Jaqueta", 200)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES (2, "Blusa", 80)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES (3, "Vestido", 150)')
cursor.execute('INSERT INTO compras(cliente_id, produto, valor) VALUES (4, "Short", 90)')

In [ ]:
df = cursor.execute('SELECT * FROM compras')
for compras in df:
    print(compras)

(None, 1, 'Jaqueta', 200.0)
(None, 2, 'Blusa', 80.0)
(None, 3, 'Vestido', 150.0)
(None, 4, 'Short', 90.0)

In [ ]:
# Criando uma nova tabela utilizando o Inner Join com base nas chaves

cursor.execute('''
    CREATE TABLE clientes_compras AS
    SELECT clientes.nome, compras.produto, compras.valor
    FROM compras
    INNER JOIN clientes ON compras.cliente_id = clientes.id;
''')

In [ ]:
df = cursor.execute('SELECT * FROM clientes_compras')
for linha in df:
    print(linha)

('Natalia Tasso', 'Jaqueta', 200.0)
('Rodrigo Luiz', 'Blusa', 80.0)
('Nicole Biggi', 'Vestido', 150.0)
('Catarina Freitas', 'Short', 90.0)